branches/Interfaces/character_generator/app/controllers/dnd_characters_controller.rb

SELECT "dnd_characters".* FROM "dnd_characters"
---
  def index
    @dnd_characters = DndCharacter.all

SELECT "dnd_characters".* FROM "dnd_characters" WHERE "dnd_characters"."id" = 1 LIMIT 1
SELECT "dnd_characters".* FROM "dnd_characters" WHERE "dnd_characters"."name" = 'Ellywick' LIMIT 1
---
  def show
    begin
    @dnd_character = DndCharacter.find(params[:id])
    rescue
    puts params[:id]
    @dnd_character = DndCharacter.find_by_name(params[:id])

SELECT "dnd_characters".* FROM "dnd_characters" WHERE "dnd_characters"."id" = 3 LIMIT 1
---
  def edit
    @dnd_character = DndCharacter.find(params[:id])

INSERT INTO "dnd_characters" ("name", "seed", "settings", "created_at", "updated_at") VALUES ('Newby', 12424351, '1234', '2011-08-15 20:52:38.406250', '2011-08-15 20:52:38.406250')
---
  def create

    generator = CharacterGenerator.new
    @character = generator.generate_specific_level_character(1, 1, sources = ["PHB","MM"], seed = params[:dnd_character][:seed].to_i)
    params[:dnd_character][:name] =@character.name.to_s
    @dnd_character = DndCharacter.new(params[:dnd_character])
    puts params

    respond_to do |format|
      if @dnd_character.save

SELECT "dnd_characters".* FROM "dnd_characters" WHERE "dnd_characters"."id" = 3 LIMIT 1
UPDATE "dnd_characters" SET "seed" = 24523462346236866789, "name" = 'Lavender', "updated_at" = '2011-08-16 15:11:13.343750' WHERE "dnd_characters"."id" = 11
---
  def update
    @dnd_character = DndCharacter.find(params[:id])
    generator = CharacterGenerator.new
    @character = generator.generate_specific_level_character(1, 1, sources = ["PHB","MM"], seed = params[:dnd_character][:seed].to_i)
    params[:dnd_character][:name] =@character.name.to_s

    respond_to do |format|
      if @dnd_character.update_attributes(params[:dnd_character])

SELECT "dnd_characters".* FROM "dnd_characters" WHERE "dnd_characters"."id" = 1 LIMIT 1
DELETE FROM "dnd_characters" WHERE "dnd_characters"."id" = 1
---
  def destroy
    @dnd_character = DndCharacter.find(params[:id])
    @dnd_character.destroy